package com.proCode.test4;

public class SameQueue {
    public static void main(String[] args) {
//        ✅ [문제 요약]
//        두 개의 큐 queue1, queue2가 주어집니다.
//        각 큐에서 한 요소를 꺼내서 다른 큐의 끝에 추가하는 작업을
//        반복해서 두 큐의 원소 합을 같게 만들고자 합니다.
//        이때 작업 횟수의 최소값을 구하는 문제입니다.
//        단, 한 번의 작업은 pop + insert 를 포함합니다.
//
//        큐는 FIFO(먼저 들어온 원소 먼저 나감) 구조입니다. 불가능할 경우 -1을 리턴합니다.
//
//        ✅ [문제 조건]
//        각 큐의 길이 ≤ 300,000
//        각 원소 ≤ 10⁹
//        큐의 원소 합은 long으로 처리해야 함 (오버플로우 가능성 있음)


    }
}
